In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
# Create students DataFrame
students = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'course_id': [101, 102, 103, None]  # None represents NULL in Python
})

# Create classes DataFrame
courses = pd.DataFrame({
    'course_id': [101, 102, 104],
    'course_name': ['Math', 'Science', 'History']
})

In [8]:
students

   id     name  course_id
0   1    Alice      101.0
1   2      Bob      102.0
2   3  Charlie      103.0
3   4    David        NaN

In [9]:
courses

   course_id course_name
0        101        Math
1        102     Science
2        104     History

In [11]:
pd.merge(students, courses, how = 'inner', on = 'course_id')

   id   name  course_id course_name
0   1  Alice      101.0        Math
1   2    Bob      102.0     Science

In [12]:
pd.merge(students, courses, how = 'left', on = 'course_id')

   id     name  course_id course_name
0   1    Alice      101.0        Math
1   2      Bob      102.0     Science
2   3  Charlie      103.0         NaN
3   4    David        NaN         NaN

In [13]:
pd.merge(students, courses, how = 'right', on = 'course_id')

    id   name  course_id course_name
0  1.0  Alice      101.0        Math
1  2.0    Bob      102.0     Science
2  NaN    NaN      104.0     History

In [14]:
pd.merge(students, courses, how = 'outer', on = 'course_id')

    id     name  course_id course_name
0  1.0    Alice      101.0        Math
1  2.0      Bob      102.0     Science
2  3.0  Charlie      103.0         NaN
3  NaN      NaN      104.0     History
4  4.0    David        NaN         NaN